# 2회 기출 변형

- 작업 3유형 통계 반영

# 작업 1유형

데이터설명 : 보스턴집값, 각 행은 지역구별 집값관련된 메타정보 : https://www.kaggle.com/datasets/arunjathari/bostonhousepricedata\
**DataUrl = https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e2_p1_1.csv**

In [17]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e2_p1_1.csv')
df.head(10)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,NaN,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,NaN,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,NaN,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,NaN,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,NaN,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2
5,0.02985,0.0,2.18,0,0.458,6.430,58.7,6.0622,3,222.0,18.7,394.12,5.21,28.7
6,0.08829,12.5,7.87,0,0.524,6.012,66.6,5.5605,5,311.0,15.2,395.60,12.43,22.9
7,0.14455,NaN,7.87,0,0.524,NaN,96.1,5.9505,5,311.0,15.2,396.90,19.15,27.1
8,0.21124,12.5,7.87,0,0.524,5.631,100.0,6.0821,5,311.0,15.2,386.63,29.93,16.5
9,0.17004,12.5,7.87,0,0.524,6.004,85.9,6.5921,5,311.0,15.2,386.71,17.10,18.9

**1-1. 주어진 Dataset에서 CRIM값이 가장 큰 10개의 지역을 구하고 10개의 지역의 CRIM값을 그 중 가장 작은 값으로 대체하라. 그리고 AGE 컬럼 값이 80이상인 대체된 CRIM 평균값을 구하라.**

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 506 entries, 0 to 505
Data columns (total 14 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   CRIM     506 non-null    float64
 1   ZN       466 non-null    float64
 2   INDUS    506 non-null    float64
 3   CHAS     506 non-null    int64
 4   NOX      506 non-null    float64
 5   RM       468 non-null    float64
 6   AGE      506 non-null    float64
 7   DIS      506 non-null    float64
 8   RAD      506 non-null    int64
 9   TAX      506 non-null    float64
 10  PTRATIO  506 non-null    float64
 11  B        506 non-null    float64
 12  LSTAT    506 non-null    float64
 13  MEDV     506 non-null    float64
dtypes: float64(12), int64(2)
memory usage: 55.5 KB

In [19]:
# my answer
max = df.sort_values('CRIM', ascending=False)['CRIM'].iloc[:10].max()
min = df.sort_values('CRIM', ascending=False)['CRIM'].iloc[:10].min()

df['CRIM'] = df['CRIM'].map(lambda x: min if (x >= min) & (x <= max) else x)
df[df['AGE'] >= 80]['CRIM'].mean()

5.759386625

In [20]:
# ideal answer
df = df.sort_values('CRIM', ascending=False).reset_index(drop=True)
df.loc[:9, 'CRIM'] = df.loc[:9, 'CRIM'].min()

df[df['AGE'] >= 80]['CRIM'].mean()

5.759386625

**1-2. 1-1에서 사용한 데이터에서 RM 중앙값으로 해당 컬럼의 결측치를 대체하라. 그리고 해당 컬럼의 결측치 대치 전후의 표준편차 차이의 절댓값을 소숫점 이하 3째자리 까지 구하라.**
```

In [21]:
before_fill = df['RM'].std()
df['RM'] = df['RM'].fillna(df['RM'].median())
after_fill = df['RM'].std()
print(before_fill, after_fill)

0.7212529033559509 0.6938906198881796

In [38]:
result = after_fill - before_fill
print('result : %0.3f'%abs(result))

# print('result :', abs(round(after_fill - before_fill,3)))

result : 0.027
result : 0.027

**1-3.주어진 Dataset의 DIS 평균으로 부터 1.5 * 표준편차를 벗어나는 영역을 이상치라고 판단하고 DIS 컬럼의 이상치들의 합을 구하여라.**

In [45]:
Q1 = df['DIS'].mean() + (1.5 * df['DIS'].std())
Q3 = df['DIS'].mean() - (1.5 * df['DIS'].std())

result = df[(df['DIS'] > Q1) | (df['DIS'] < Q3)]['DIS'].sum()

print(result)

404.4101

# 작업 2유형

데이터 설명 : e-commerce 배송의 정시 도착여부 (1: 정시배송 0 : 정시미배송)    \
x_train: https://raw.githubusercontent.com/Datamanim/datarepo/main/shipping/X_train.csv    \
y_train: https://raw.githubusercontent.com/Datamanim/datarepo/main/shipping/y_train.csv  \
x_test: https://raw.githubusercontent.com/Datamanim/datarepo/main/shipping/X_test.csv    \
x_label(평가용) : https://raw.githubusercontent.com/Datamanim/datarepo/main/shipping/y_test.csv    \
데이터 출처 :https://www.kaggle.com/datasets/prachi13/customer-analytics (참고, 데이터 수정)       \
\
**x_train 데이터로 학습한 모델을 x_test에 적용하여 예측한 결과를 제출하라. 평가 지표는 f1_score이다.**

In [73]:
import pandas as pd
#데이터 로드
x_train = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/shipping/X_train.csv")
y_train = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/shipping/y_train.csv")
x_test= pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/shipping/X_test.csv")


display(x_train.head())
display(y_train.head())

,ID,Warehouse_block,Mode_of_Shipment,Customer_care_calls,Customer_rating,Cost_of_the_Product,Prior_purchases,Product_importance,Gender,Discount_offered,Weight_in_gms
0,6045,A,Flight,4,3,266,5,high,F,5,1590
1,44,F,Ship,3,1,174,2,low,M,44,1556
2,7940,F,Road,4,1,154,10,high,M,10,5674
3,1596,F,Ship,4,3,158,3,medium,F,27,1207
4,4395,A,Flight,5,3,175,3,low,M,7,4833

     ID  Reached.on.Time_Y.N
0  6045                    0
1    44                    1
2  7940                    1
3  1596                    1
4  4395                    1

In [74]:
print(x_train.shape, x_test.shape, y_train.shape)

(6598, 11) (4401, 11) (6598, 2)

In [75]:
x_train.head()

,ID,Warehouse_block,Mode_of_Shipment,Customer_care_calls,Customer_rating,Cost_of_the_Product,Prior_purchases,Product_importance,Gender,Discount_offered,Weight_in_gms
0,6045,A,Flight,4,3,266,5,high,F,5,1590
1,44,F,Ship,3,1,174,2,low,M,44,1556
2,7940,F,Road,4,1,154,10,high,M,10,5674
3,1596,F,Ship,4,3,158,3,medium,F,27,1207
4,4395,A,Flight,5,3,175,3,low,M,7,4833

In [76]:
y_train.head()

     ID  Reached.on.Time_Y.N
0  6045                    0
1    44                    1
2  7940                    1
3  1596                    1
4  4395                    1

In [78]:
x_train.isnull().sum()

ID                     0
Warehouse_block        0
Mode_of_Shipment       0
Customer_care_calls    0
Customer_rating        0
Cost_of_the_Product    0
Prior_purchases        0
Product_importance     0
Gender                 0
Discount_offered       0
Weight_in_gms          0
dtype: int64

In [79]:
x_test.isnull().sum()

ID                     0
Warehouse_block        0
Mode_of_Shipment       0
Customer_care_calls    0
Customer_rating        0
Cost_of_the_Product    0
Prior_purchases        0
Product_importance     0
Gender                 0
Discount_offered       0
Weight_in_gms          0
dtype: int64

In [80]:
x_train.describe()

,ID,Customer_rating,Cost_of_the_Product,Prior_purchases,Discount_offered,Weight_in_gms
count,6598.000000,6598.000000,6598.000000,6598.000000,6598.000000,6598.000000
mean,5476.977266,2.991361,210.393149,3.577751,13.353592,3604.191119
std,3172.946154,1.409624,48.258089,1.511394,16.187267,1635.697627
min,1.000000,1.000000,96.000000,2.000000,1.000000,1001.000000
25%,2731.250000,2.000000,170.000000,3.000000,4.000000,1834.250000
50%,5476.000000,3.000000,214.000000,3.000000,7.000000,4119.500000
75%,8187.750000,4.000000,251.000000,4.000000,10.000000,5027.500000
max,10998.000000,5.000000,310.000000,10.000000,65.000000,7684.000000

In [81]:
x_test.describe()

,ID,Customer_rating,Cost_of_the_Product,Prior_purchases,Discount_offered,Weight_in_gms
count,4401.000000,4401.000000,4401.000000,4401.000000,4401.000000,4401.000000
mean,5534.515792,2.989321,209.902522,3.552374,13.402636,3678.731425
std,3178.829286,1.419707,47.773674,1.539936,16.234661,1634.062893
min,2.000000,1.000000,96.000000,2.000000,1.000000,1001.000000
25%,2772.000000,2.000000,169.000000,3.000000,4.000000,1861.000000
50%,5537.000000,3.000000,215.000000,3.000000,7.000000,4195.000000
75%,8322.000000,4.000000,251.000000,4.000000,10.000000,5083.000000
max,10999.000000,5.000000,310.000000,10.000000,65.000000,7846.000000

In [82]:
x_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6598 entries, 0 to 6597
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   6598 non-null   int64
 1   Warehouse_block      6598 non-null   object
 2   Mode_of_Shipment     6598 non-null   object
 3   Customer_care_calls  6598 non-null   object
 4   Customer_rating      6598 non-null   int64
 5   Cost_of_the_Product  6598 non-null   int64
 6   Prior_purchases      6598 non-null   int64
 7   Product_importance   6598 non-null   object
 8   Gender               6598 non-null   object
 9   Discount_offered     6598 non-null   int64
 10  Weight_in_gms        6598 non-null   int64
dtypes: int64(6), object(5)
memory usage: 567.1+ KB

In [83]:
x_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4401 entries, 0 to 4400
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   4401 non-null   int64
 1   Warehouse_block      4401 non-null   object
 2   Mode_of_Shipment     4401 non-null   object
 3   Customer_care_calls  4401 non-null   object
 4   Customer_rating      4401 non-null   int64
 5   Cost_of_the_Product  4401 non-null   int64
 6   Prior_purchases      4401 non-null   int64
 7   Product_importance   4401 non-null   object
 8   Gender               4401 non-null   object
 9   Discount_offered     4401 non-null   int64
 10  Weight_in_gms        4401 non-null   int64
dtypes: int64(6), object(5)
memory usage: 378.3+ KB

In [87]:
x_train[['Warehouse_block', 'Mode_of_Shipment', 'Product_importance', 'Gender']].nunique()

Warehouse_block       5
Mode_of_Shipment      3
Product_importance    3
Gender                2
dtype: int64

In [88]:
from sklearn.preprocessing import LabelEncoder

encoder = LabelEncoder()
x_train['Customer_care_calls'] = encoder.fit_transform(x_train['Customer_care_calls'])
x_test['Customer_care_calls'] = encoder.fit_transform(x_test['Customer_care_calls'])

In [90]:
x_train = x_train.drop(columns=['Warehouse_block', 'Mode_of_Shipment', 'Product_importance', 'Gender'])
x_test = x_test.drop(columns=['Warehouse_block', 'Mode_of_Shipment', 'Product_importance', 'Gender'])

In [109]:
from sklearn.linear_model import LogisticRegression
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import roc_auc_score

In [92]:
x_train_id = x_train.pop('ID')
x_test_id = x_test.pop('ID')
x_train.head()

,Customer_care_calls,Customer_rating,Cost_of_the_Product,Prior_purchases,Discount_offered,Weight_in_gms
0,3,3,266,5,5,1590
1,2,1,174,2,44,1556
2,3,1,154,10,10,5674
3,3,3,158,3,27,1207
4,4,3,175,3,7,4833

In [93]:
from sklearn.model_selection import train_test_split

X_train, X_test, Y_train, Y_test = train_test_split(x_train, y_train['Reached.on.Time_Y.N'], test_size=0.2, random_state=1234)

In [110]:
model_lgm = LogisticRegression()
model_lgm.fit(X_train, Y_train)
pred_lgm = model_lgm.predict_proba(X_test)
roc_auc_score(Y_test, pred_lgm[:,1])

0.7187978175677753

In [111]:
model_dt = DecisionTreeClassifier()
model_dt.fit(X_train, Y_train)
pred_dt = model_dt.predict_proba(X_test)
roc_auc_score(Y_test, pred_dt[:, 1])

0.6316258741672205

In [112]:
model_rf = RandomForestClassifier()
model_rf.fit(X_train, Y_train)
pred_rf = model_rf.predict_proba(X_test)
roc_auc_score(Y_test, pred_dt[:, 1])

0.6316258741672205

In [113]:
model = RandomForestClassifier()
model.fit(x_train, y_train['Reached.on.Time_Y.N'])
pred = model.predict_proba(x_test)

In [114]:
pred

array([[0.56, 0.44],
       [0.64, 0.36],
       [0.73, 0.27],
       ...,
       [0.56, 0.44],
       [0.61, 0.39],
       [0.  , 1.  ]])

In [115]:
result = pd.DataFrame({"ID": x_test_id, "Reached.on.Time_Y.N": pred[:, 1]})
result

         ID  Reached.on.Time_Y.N
0      6811                 0.44
1      4320                 0.36
2      5732                 0.27
3      7429                 0.53
4      2191                 1.00
...     ...                  ...
4396   2610                 1.00
4397   3406                 0.40
4398  10395                 0.44
4399   3646                 0.39
4400    573                 1.00

[4401 rows x 2 columns]

# 작업 3유형

어느 호수에서 잡은 물고기 122마리 길이 데이터(자체제작)\
**DataUrl = https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e2_p3_1.csv**

In [69]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e2_p3_1.csv')
df.head(5)

     fish   height
0  fish_1  33.74cm
1  fish_2  31.64cm
2  fish_3  27.49cm
3  fish_4  31.43cm
4  fish_5  27.56cm

**3-1-a. 122마리의 height 평균값을 m(미터) 단위로 소숫점 이하 5자리까지 실수 값만 출력하라**

In [68]:
# my answer

df['height'] = df['height'].map(lambda x: float(x.replace('cm', '')))
round(df.height.mean()*1/100, 5)

0.29951

In [70]:
# ideal answer

df['height_raw'] =df['height'].str.replace('cm','').astype('float')
result = round(df['height_raw'].mean()/100,5)
result

0.29951

**3-1-b. 모집단의 평균 길이가 30cm 인지 확인하려 일표본 t 검정을 시행하여 확인하려한다. 검정통계량을 소숫점 이하 3째자리까지 구하여라**

**3-1-c. 위의 통계량에 대한 p-값을 구하고 (반올림하여 소숫점 이하 3째자리), 유의수준 0.05하에서 귀무가설과 대립가설중 유의한 가설을 하나를 선택하시오(귀무/대립)**

조사결과 70%의 성인 남성이 3년 동안에 적어도 1번 치과를 찾는다고 할때, 21명의 성인 남성이 임의로 추출되었다고 하자.

**3-2-a. 21명 중 16명 미만이 치과를 찾았을 확률(반올림하여 소숫점 이하 3자리)**

**3-2-b. 적어도 19명이 치과를 찾았을 확률(반올림하여 소숫점 이하 3자리)**